In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [14]:
df = pd.read_csv('/Users/lucaslee/Documents/GitHub/Lucas-ml-kit/data_set/titanic_raw.csv')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [23]:
# print the columns and shape
print('shape of the titanic data:')
print(df.shape)
print('------------------')
print(df.columns)

shape of the titanic data:
(891, 15)
------------------
Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [25]:
# summary of na values
df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [37]:
# EDA process

print('Toal Survived rate:')
print((df['survived'].sum() / len(df['survived'])).round(4))

# relationship between Survived and Pclass 
cross_tbl = pd.crosstab(df['survived'], df['pclass'])
cross_tbl

Toal Survived rate:
0.3838

pclass      1   2    3
survived
0          80  97  372
1         136  87  119